## Plans :thumbsup:
## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## AWS-EKS :thumbsup:
**Dir**: AWS-EKS
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0] has changed
!   resource "aws_eks_node_group" "this" {
+       arn                    = "arn:aws:eks:us-east-1:834277767436:nodegroup/eks-cluster/green-2023091016063974380000000a/bcc53fec-2ce6-6f2c-e118-2280fc91865a"
        id                     = "eks-cluster:green-2023091016063974380000000a"
+       resources              = [
+           {
+               autoscaling_groups              = [
+                   {
+                       name = "eks-green-2023091016063974380000000a-bcc53fec-2ce6-6f2c-e118-2280fc91865a"
                    },
                ]
+               remote_access_security_group_id = ""
            },
        ]
        tags                   = {
            "Name" = "green"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
!       ami_type               = "AL2_x86_64" -> (known after apply)
!       arn                    = "arn:aws:eks:us-east-1:834277767436:nodegroup/eks-cluster/green-2023091016063974380000000a/bcc53fec-2ce6-6f2c-e118-2280fc91865a" -> (known after apply)
!       disk_size              = 0 -> (known after apply)
!       id                     = "eks-cluster:green-2023091016063974380000000a" -> (known after apply)
-       labels                 = {} -> null
!       node_group_name        = "green-2023091016063974380000000a" -> (known after apply)
!       release_version        = "1.27.4-20230825" -> (known after apply)
!       resources              = [
-           {
-               autoscaling_groups              = [
-                   {
-                       name = "eks-green-2023091016063974380000000a-bcc53fec-2ce6-6f2c-e118-2280fc91865a"
                    },
                ]
-               remote_access_security_group_id = ""
            },
        ] -> (known after apply)
!       status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "green"
        }
        # (8 unchanged attributes hidden)

!       launch_template {
!           id      = "lt-0dc709e9a10ed7255" -> (known after apply)
            name    = "green-20230910160639068800000008"
            # (1 unchanged attribute hidden)
        }

!       update_config {
!           max_unavailable            = 1 -> (known after apply)
!           max_unavailable_percentage = 0 -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```


</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| AWS-EKS | default | 101.25 | 101.25 | 0.00|
| | **Total** | **101.25** | **101.25** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
